Autodesk.Revit.DB.DatumPlane.PropagateToViews(Autodesk.Revit.DB.View,System.Collections.Generic.ISet`1{Autodesk.Revit.DB.ElementId})
Propagates the extents applied to this datum in the view to the specified parallel views.
view:
The view on which the DatumPlane shows.
parallelViews:
The ids of the specified parallel views.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The datum plane cannot be visible in the view.
-or-
One ElementId in parallelViews is not valid for extent propagation.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2016